Revit 2027 API
RebarContainerItem.Normal Property
 A unit-length vector normal to the plane of the rebar
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Normal { get; }
Public ReadOnly Property Normal As XYZ
	Get
public:
property XYZ^ Normal {
	XYZ^ get ();
}
member Normal : XYZ with get
Property Value
XYZ
See Also
Reference
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace